cats/app/controllers/cats_controller.rb

    def index
        @all_cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def edit
        @cat_found =  Cat.find_by(id: params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        @cat_found =  Cat.find_by(id: params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]